In [2]:
import numpy as np
import pandas as pd

In [5]:
dataFile='E:\\NLP\\ml1\\u.data'
data=pd.read_csv(dataFile,sep="\t",header=None,names=['userId','itemId','rating','timestamp'])

In [11]:
data.head()

   userId  itemId  rating  timestamp
0     196     242       3  881250949
1     186     302       3  891717742
2      22     377       1  878887116
3     244      51       2  880606923
4     166     346       1  886397596

In [9]:
movieInfoFile='E:\\NLP\\ml1\\u.item'
movieInfo=pd.read_csv(movieInfoFile,sep="|",header=None,index_col=False,names=['itemId','title'],usecols=[0,1],encoding='ISO-8859-1')

In [10]:
movieInfo.head()

   itemId              title
0       1   Toy Story (1995)
1       2   GoldenEye (1995)
2       3  Four Rooms (1995)
3       4  Get Shorty (1995)
4       5     Copycat (1995)

In [12]:
data=pd.merge(data,movieInfo,left_on='itemId',right_on='itemId')

In [13]:
data.head()

   userId  itemId  rating  timestamp         title
0     196     242       3  881250949  Kolya (1996)
1      63     242       3  875747190  Kolya (1996)
2     226     242       5  883888671  Kolya (1996)
3     154     242       3  879138235  Kolya (1996)
4     306     242       5  876503793  Kolya (1996)

In [14]:
data.loc[0:10,['userId']]

    userId
0      196
1       63
2      226
3      154
4      306
5      296
6       34
7      271
8      201
9      209
10      35

In [18]:
def favoriteMovies(activeUser,N):
    topMovies=pd.DataFrame.sort_values(data[data.userId==activeUser],['rating'],ascending=[0])[:N]
    return list(topMovies.title)
favoriteMovies(5,3)

['Empire Strikes Back, The (1980)',
 'Blade Runner (1982)',
 'Wrong Trousers, The (1993)']